USE [ReviewsDB]
GO

ALTER DATABASE [ReviewsDB] COLLATE Latin1_General_100_CI_AS_SC_UTF8;



INSERT INTO [dbo].[Reviews] (UserName, OrganizationName, Address, Liked, Disliked, Comments, Rating, CreatedAt, UpdatedAt)
VALUES 
(N'Алексей Иванов', N'ООО Ромашка', N'Москва, ул. Ленина, 1', N'Качество товара', N'Долгая доставка', N'Отличный товар!', FLOOR(RAND() * 5) + 1, GETDATE(), GETDATE()),
(N'Мария Петрова', N'ЗАО Солнце', N'Санкт-Петербург, пр. Невский, 10', N'Отличный сервис', N'Неудобное приложение', N'Рекомендую всем!', FLOOR(RAND() * 5) + 1, GETDATE(), GETDATE()),
(N'Иван Смирнов', N'ИП Сибирь', N'Екатеринбург, ул. Уралмаш, 5', N'Быстрая доставка', N'Высокая цена', N'Хороший опыт!', FLOOR(RAND() * 5) + 1, GETDATE(), GETDATE()),
(N'Елена Кузнецова', N'ООО Север', N'Новосибирск, ул. Красный проспект, 15', N'Удобство использования', N'Мало функций', N'Неплохой продукт.', FLOOR(RAND() * 5) + 1, GETDATE(), GETDATE()),
(N'Дмитрий Васильев', N'ЗАО Юг', N'Казань, ул. Баумана, 20', N'Приятный дизайн', N'Не хватает инструкции', N'Хорошая покупка.', FLOOR(RAND() * 5) + 1, GETDATE(), GETDATE()),
(N'Анна Сергеева', N'ИП Восток', N'Челябинск, ул. Труда, 30', N'Качественные материалы', N'Тяжело разобраться в настройках', N'Смешанные чувства.', FLOOR(RAND() * 5) + 1, GETDATE(), GETDATE()),
(N'Сергей Ковалев', N'ООО Запад', N'Уфа, ул. Ленина, 25', N'Работает без сбоев', N'Дороговато для такого качества', N'В целом доволен.', FLOOR(RAND() * 5) + 1, GETDATE(), GETDATE()),
(N'Татьяна Федорова', N'ЗАО Центр', N'Ростов-на-Дону, ул. Пушкинская, 12', N'Легкость в использовании', N'Неудобный интерфейс', N'Могу рекомендовать.', FLOOR(RAND() * 5) + 1, GETDATE(), GETDATE()),
(N'Александр Николаев', N'ИП Сибирь-Юг', N'Волгоград, ул. Советская, 8', N'Скорость работы приложения', N'Проблемы с обновлениями', N'Не плохой выбор.', FLOOR(RAND() * 5) + 1, GETDATE(), GETDATE()),
(N'Ольга Михайлова', N'ООО Прогресс', N'Улица Пушкина, дом Колотушкина',N'Отличное качество сборки',N'Мало аксессуаров в комплекте',N'Хороший продукт.', FLOOR(RAND() * 5) + 1,GETDATE(), GETDATE()),
(N'Виктория Григорьева',N'ЗАО Урал-Юг',N'Ижевск ,ул. Первомайская ,14',N'Интуитивно понятный интерфейс.',N'Слишком много рекламы.',N'Отличный выбор!', FLOOR(RAND() * 5) + 1,GETDATE(), GETDATE()),
(N'Роман Орлов',N'ИП Сервис+',N'Барнаул ,ул. Строителей ,9a',N'Приятная упаковка',N'Долгое время ожидания',N'Хороший опыт покупок.', FLOOR(RAND() * 5) + 1,GETDATE(), GETDATE()),
(N'Наталья Соловьева',N'ЗАО Техно',N'Калуга ,ул. Ленина ,3',N'Удобно в использовании',N'Нет гарантии на товар',N'Рекомендую всем.', FLOOR(RAND() * 5) + 1,GETDATE(), GETDATE()),
(N'Андрей Васильев', N'ООО Эко',N'Тверь ,ул. Спартака ,11',N'Хорошая цена', N'Неудобное управление', N'Хороший сервис.', FLOOR(RAND() * 5) + 1,GETDATE(), GETDATE()),
(N'Евгения Романова', N'ИП Супер', N'Саратов ,ул. Гагарина ,4', N'Качественный товар', N'Медленная доставка', N'Всё отлично!', FLOOR(RAND() * 5) + 1,GETDATE(), GETDATE()),
(N'Валентин Петрович', N'ЗАО Мега', N'Тула ,ул. Революции ,6', N'Отличная поддержка клиентов', N'Не хватает информации на сайте', N'Хороший опыт покупок.', FLOOR(RAND() * 5) + 1,GETDATE(), GETDATE());
